# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
df_cut = pd.read_csv(r'C:\Users\boudl\Instacart Basket Analysis\02 Data\Original Data\customers.csv')
#import dataframe

# Data Study, Cleaning

In [3]:
df_cut.head(5)
#display first five rows of dataframe

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
df_cut.shape
#display shape of dataframe

(206209, 10)

In [10]:
df_cut[['Age', 'income']].describe()
#descriptive statistics of dataframe

                 Age         income
count  206209.000000  206209.000000
mean       49.501646   94632.852548
std        18.480962   42473.786988
min        18.000000   25903.000000
25%        33.000000   59874.000000
50%        49.000000   93547.000000
75%        66.000000  124244.000000
max        81.000000  593901.000000

In [11]:
df_cut.drop(columns = ['First Name' , 'Surnam'])
#drop columns containing data related to customer privacy

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...
206204,168073,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Female,California,27,4/1/2020,1,married,99799
206208,80148,Female,New York,55,4/1/2020,1,married,57095

In [12]:
df_cut = df_cut.drop(columns = ['First Name' , 'Surnam'])
#define dataframe with changes

In [13]:
df_cut.head(5)

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [19]:
df_cut.dtypes
#display datatypes of columns

user_id          int64
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [14]:
df_cut.groupby('STATE')['user_id'].nunique()
#study how many users or customers per state

STATE
Alabama                 4044
Alaska                  4044
Arizona                 4044
Arkansas                4044
California              4044
Colorado                4044
Connecticut             4044
Delaware                4044
District of Columbia    4044
Florida                 4044
Georgia                 4044
Hawaii                  4044
Idaho                   4044
Illinois                4044
Indiana                 4044
Iowa                    4044
Kansas                  4043
Kentucky                4043
Louisiana               4043
Maine                   4043
Maryland                4043
Massachusetts           4043
Michigan                4043
Minnesota               4043
Mississippi             4043
Missouri                4043
Montana                 4043
Nebraska                4043
Nevada                  4043
New Hampshire           4043
New Jersey              4043
New Mexico              4043
New York                4043
North Carolina          4043
North Dakota            4043
Ohio                    4043
Oklahoma                4043
Oregon                  4043
Pennsylvania            4043
Rhode Island            4043
South Carolina          4043
South Dakota            4043
Tennessee               4043
Texas                   4043
Utah                    4043
Vermont                 4043
Virginia                4043
Washington              4043
West Virginia           4043
Wisconsin               4043
Wyoming                 4043
Name: user_id, dtype: int64

In [20]:
df_cut['Gender'] = df_cut['Gender'].astype('string')
#convert this column to string dtype

In [21]:
df_cut['STATE'] = df_cut['STATE'].astype('string')
#convert this column to string dtype

In [22]:
df_cut['fam_status'] = df_cut['fam_status'].astype('string')
#convert this column to string dtype

In [23]:
df_cut['date_joined'] = pd.to_datetime(df_cut['date_joined'], format='%d/%m/%Y', errors='coerce')
#convert thsi column to a date time dtype

In [24]:
df_cut.dtypes
#confirm dtypes of columns after changes

user_id                  int64
Gender          string[python]
STATE           string[python]
Age                      int64
date_joined     datetime64[ns]
n_dependants             int64
fam_status      string[python]
income                   int64
dtype: object

In [25]:
missing_user_id = df_cut['user_id'].isna().sum()
#determine if missing values in user id column

In [26]:
print("Missing or NaN values in 'user_id':", missing_user_id)

Missing or NaN values in 'user_id': 0

In [27]:
missing_age = df_cut['Age'].isna().sum()
#determine if missing values in Age column

In [28]:
print("Missing or NaN values in 'Age':", missing_age)

Missing or NaN values in 'Age': 0

In [29]:
missing_income = df_cut['income'].isna().sum()
#determine if missing values in income column

In [30]:
print("Missing or NaN values in 'income':", missing_income)

Missing or NaN values in 'income': 0

# Export Changes

In [31]:
df_cut.to_csv(r'C:\Users\boudl\Instacart Basket Analysis\02 Data\Prepared Data\customers_check.csv')
#export dataframe

In [32]:
df_cut.to_pickle(r'C:\Users\boudl\Instacart Basket Analysis\02 Data\Prepared Data\customers_check.pkl')
#export dataframe